# Configuring RIPv2


Part 1 / Step 1
=================

RIPv2 on R1:
++++++++++++

R1>
R1>enable
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip route 0.0.0.0 0.0.0.0 serial 0/0/1
%Default route without gateway, if not a point-to-point interface, may impact performance
R1(config)#router rip 
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#do show ip route connected
 C   192.168.1.0/24  is directly connected, GigabitEthernet0/0
 C   192.168.2.0/24  is directly connected, Serial0/0/0
 C   209.165.200.224/30  is directly connected, Serial0/0/1

R1(config-router)#network 192.168.1.0
R1(config-router)#network 192.168.2.0
R1(config-router)#passive
R1(config-router)#passive-interface gi
R1(config-router)#passive-interface gigabitEthernet 0/0
R1(config-router)#defaul
R1(config-router)#default-information or
R1(config-router)#default-information originate 
R1(config-router)#^Z
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#copy run
R1#copy running-config st
R1#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#


RIP v2 on R2:
+++++++++++++
R2>
R2>enable
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router rip
R2(config-router)#version 2
R2(config-router)#no auto
R2(config-router)#no auto-summary 
R2(config-router)#do show ip ro
R2(config-router)#do show ip route connected
 C   192.168.2.0/24  is directly connected, Serial0/0/0
 C   192.168.3.0/24  is directly connected, GigabitEthernet0/0
 C   192.168.4.0/24  is directly connected, Serial0/0/1

R2(config-router)#network 192.168.2.0
R2(config-router)#network 192.168.3.0
R2(config-router)#network 192.168.4.0
R2(config-router)#passive
R2(config-router)#passive-interface g
R2(config-router)#passive-interface gigabitEthernet 0/0
R2(config-router)#^Z
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#copy run
R2#copy running-config s
R2#copy running-config st
R2#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
R2#

RIP V2 on R3:
+++++++++++++
R3>
R3>enable
R3#cofigure terminal
            ^
% Invalid input detected at '^' marker.
	
R3#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#reouter rip
            ^
% Invalid input detected at '^' marker.
	
R3(config)#router rip
R3(config-router)#version 2
R3(config-router)#no au
R3(config-router)#no auto-summary 
R3(config-router)#do show ip route connected
 C   192.168.4.0/24  is directly connected, Serial0/0/1
 C   192.168.5.0/24  is directly connected, GigabitEthernet0/0

R3(config-router)#network 192.168.4.0
R3(config-router)#network 192.168.5.0
R3(config-router)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

R3(config-router)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

R3(config-router)#pass
R3(config-router)#passive-interface gi
R3(config-router)#passive-interface gigabitEthernet 0/0
R3(config-router)#^Z
R3#
%SYS-5-CONFIG_I: Configured from console by console

R3#copy run
R3#copy running-config str
R3#copy running-config st
R3#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
R3#

Part 2 Verify configuration:
============================
Command to show routing table on each router
on R1

R1>enable
R1# show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is 0.0.0.0 to network 0.0.0.0

     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/0
L       192.168.1.1/32 is directly connected, GigabitEthernet0/0
     192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.2.0/24 is directly connected, Serial0/0/0
L       192.168.2.1/32 is directly connected, Serial0/0/0
R    192.168.3.0/24 [120/1] via 192.168.2.2, 00:00:12, Serial0/0/0
R    192.168.4.0/24 [120/1] via 192.168.2.2, 00:00:12, Serial0/0/0
R    192.168.5.0/24 [120/2] via 192.168.2.2, 00:00:12, Serial0/0/0
     209.165.200.0/24 is variably subnetted, 2 subnets, 2 masks
C       209.165.200.224/30 is directly connected, Serial0/0/1
L       209.165.200.225/32 is directly connected, Serial0/0/1
S*   0.0.0.0/0 is directly connected, Serial0/0/1

R1#

All connections shoud be sucessful
