# Part 1:     Configure OSPFv3 Routing

## R1
```

R1>
R1>enable
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ipv6 unicast-routing
R1(config)#ipv6 router ospf 10
%OSPFv3-4-NORTRID: OSPFv3 process 10 could not pick a router-id,please configure manually
R1(config-rtr)#router-id 1.1.1.1
R1(config-rtr)#^Z
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#clear ipv6 ospf process
Reset ALL OSPF processes? [no]: y

R1#show ipv6 interface brief
GigabitEthernet0/0         [up/up]
    FE80::1
    2001:DB8:CAFE:1::1
GigabitEthernet0/1         [administratively down/down]
    unassigned
GigabitEthernet0/2         [administratively down/down]
    unassigned
Serial0/0/0                [up/up]
    FE80::1
    2001:DB8:CAFE:A001::1
Serial0/0/1                [up/up]
    FE80::1
    2001:DB8:CAFE:A003::1
Vlan1                      [administratively down/down]
    unassigned

R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface gigabitEthernet 0/0
R1(config-if)#ipv6 ospf 10 area 0
R1(config-if)#exit

R1(config)#interface serial 0/0/0
R1(config-if)#ipv6 ospf 10 area 0
R1(config-if)#exit

R1(config)#interface serial 0/0/1
R1(config-if)#ipv6 ospf 10 area 0
R1(config-if)#^Z
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#
```

## R2
```
R2>
R2>enabl
R2#confTER
R2#conf
R2#configure TER
R2#configure TERminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#ipv6 un
R2(config)#ipv6 unicast-routing
R2(config)#ipv6 rout
R2(config)#ipv6 router osp
R2(config)#ipv6 router ospf 10
%OSPFv3-4-NORTRID: OSPFv3 process 10 could not pick a router-id,please configure manually
R2(config-rtr)#router
R2(config-rtr)#router-id 2.2.2.2
R2(config-rtr)#^Z
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#clear ipv
R2#clear ipv6 os
R2#clear ipv6 ospf p
R2#clear ipv6 ospf process
Reset ALL OSPF processes? [no]: y

R2#
R2#show ipv
R2#show ipv6 inter
R2#show ipv6 interface br
R2#show ipv6 interface brief
GigabitEthernet0/0         [up/up]
    FE80::2
    2001:DB8:CAFE:2::1
GigabitEthernet0/1         [administratively down/down]
    unassigned
GigabitEthernet0/2         [administratively down/down]
    unassigned
Serial0/0/0                [up/up]
    FE80::2
    2001:DB8:CAFE:A001::2
Serial0/0/1                [up/up]
    FE80::2
    2001:DB8:CAFE:A002::1
Serial0/1/0                [administratively down/down]
    unassigned
Serial0/1/1                [administratively down/down]
    unassigned
Vlan1                      [administratively down/down]
    unassigned
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#inetr
R2(config)#inter
R2(config)#interface gig
R2(config)#interface gigabitEthernet 0/0
R2(config-if)#ipv6 os
R2(config-if)#ipv6 ospf 10 area 0
R2(config-if)#exit
R2(config)#interface se
R2(config)#interface serial 0/0/0
R2(config-if)#ipv6 ospf 10 area 0
R2(config-if)#exit
R2(config)#exit
00:18:30: %OSPFv3-5-ADJCHG: Process 10, Nbr 1.1.1.1 on Serial0/0/0 from LOADING to FULL, Loading D
R2(config)#
R2(config)#interface serial 0/0/1
R2(config-if)#ipv6 ospf 10 area 0
R2(config-if)#exit
R2(config)#^Z
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#
```

## R3
```

R3>
R3>
R3>ena
R3#conf t
R3#conf terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#ipv6 uni
R3(config)#ipv6 unicast-routing
R3(config)#ipv6
R3(config)#ipv6 rout
R3(config)#ipv6 router osp
R3(config)#ipv6 router ospf 10
%OSPFv3-4-NORTRID: OSPFv3 process 10 could not pick a router-id,please configure manually
R3(config-rtr)#
R3(config-rtr)#router-i
R3(config-rtr)#router-id 3.3.3.3
R3(config-rtr)#^Z
R3#
%SYS-5-CONFIG_I: Configured from console by console

R3#
R3#
R3#clear ipv
R3#clear ipv6 osp
R3#clear ipv6 ospf proc
R3#clear ipv6 ospf process
Reset ALL OSPF processes? [no]: y

R3#
R3#show ipv6 in
R3#show ipv6 inter
R3#show ipv6 interface bri
R3#show ipv6 interface brief
GigabitEthernet0/0         [up/up]
    FE80::3
    2001:DB8:CAFE:3::1
GigabitEthernet0/1         [administratively down/down]
    unassigned
GigabitEthernet0/2         [administratively down/down]
    unassigned
Serial0/0/0                [up/up]
    FE80::3
    2001:DB8:CAFE:A003::2
Serial0/0/1                [up/up]
    FE80::3
    2001:DB8:CAFE:A002::2
Vlan1                      [administratively down/down]
    unassigned
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#interf
R3(config)#interface gi
R3(config)#interface gigabitEthernet 0/0
R3(config-if)#ipv6 osp
R3(config-if)#ipv6 ospf 10 area 0
R3(config-if)#exit
R3(config)#interface s
R3(config)#interface serial 0/0/0
R3(config-if)#ipv6 ospf 10 area 0
R3(config-if)#exit
R3(config)#interface serial 0/0/
00:25:10: %OSPFv3-5-ADJCHG: Process 10, Nbr 1.1.1.1 on Serial0/0/0 from LOADING t
R3(config)#
R3(config)#interface s
R3(config)#interface serial 0/0/1
R3(config-if)#ipv6 ospf 10 area 0
R3(config-if)#exit
R3(config)#
R3(config)#
00:25:36: %OSPFv3-5-ADJCHG: Process 10, Nbr 2.2.2.2 on Serial0/0/1 from LOADING to FULL, Loading Done

```
# Step 2:     Verify OSPF routing is operational.

## R1
```
R1#show ipv6 ospf neighbor

Neighbor ID     Pri   State           Dead Time   Interface ID    Interface
2.2.2.2           0   FULL/  -        00:00:37    4               Serial0/0/0
3.3.3.3           0   FULL/  -        00:00:36    4               Serial0/0/1

R1#show ipv6 route
IPv6 Routing Table - 10 entries
Codes: C - Connected, L - Local, S - Static, R - RIP, B - BGP
       U - Per-user Static route, M - MIPv6
       I1 - ISIS L1, I2 - ISIS L2, IA - ISIS interarea, IS - ISIS summary
       ND - ND Default, NDp - ND Prefix, DCE - Destination, NDr - Redirect
       O - OSPF intra, OI - OSPF inter, OE1 - OSPF ext 1, OE2 - OSPF ext 2
       ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       D - EIGRP, EX - EIGRP external
C   2001:DB8:CAFE:1::/64 [0/0]
     via GigabitEthernet0/0, directly connected
L   2001:DB8:CAFE:1::1/128 [0/0]
     via GigabitEthernet0/0, receive
O   2001:DB8:CAFE:2::/64 [110/65]
     via FE80::2, Serial0/0/0
O   2001:DB8:CAFE:3::/64 [110/65]
     via FE80::3, Serial0/0/1
C   2001:DB8:CAFE:A001::/64 [0/0]
     via Serial0/0/0, directly connected
L   2001:DB8:CAFE:A001::1/128 [0/0]
     via Serial0/0/0, receive
O   2001:DB8:CAFE:A002::/64 [110/128]
     via FE80::2, Serial0/0/0
     via FE80::3, Serial0/0/1
C   2001:DB8:CAFE:A003::/64 [0/0]
     via Serial0/0/1, directly connected
L   2001:DB8:CAFE:A003::1/128 [0/0]
     via Serial0/0/1, receive
L   FF00::/8 [0/0]
     via Null0, receive
```

## R2
```
R2#show ipv6 ospf neighbor

Neighbor ID     Pri   State           Dead Time   Interface ID    Interface
1.1.1.1           0   FULL/  -        00:00:32    4               Serial0/0/0
3.3.3.3           0   FULL/  -        00:00:32    5               Serial0/0/1

R2#show ipv6 route
IPv6 Routing Table - 10 entries
Codes: C - Connected, L - Local, S - Static, R - RIP, B - BGP
       U - Per-user Static route, M - MIPv6
       I1 - ISIS L1, I2 - ISIS L2, IA - ISIS interarea, IS - ISIS summary
       ND - ND Default, NDp - ND Prefix, DCE - Destination, NDr - Redirect
       O - OSPF intra, OI - OSPF inter, OE1 - OSPF ext 1, OE2 - OSPF ext 2
       ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       D - EIGRP, EX - EIGRP external
O   2001:DB8:CAFE:1::/64 [110/65]
     via FE80::1, Serial0/0/0
C   2001:DB8:CAFE:2::/64 [0/0]
     via GigabitEthernet0/0, directly connected
L   2001:DB8:CAFE:2::1/128 [0/0]
     via GigabitEthernet0/0, receive
O   2001:DB8:CAFE:3::/64 [110/65]
     via FE80::3, Serial0/0/1
C   2001:DB8:CAFE:A001::/64 [0/0]
     via Serial0/0/0, directly connected
L   2001:DB8:CAFE:A001::2/128 [0/0]
     via Serial0/0/0, receive
C   2001:DB8:CAFE:A002::/64 [0/0]
     via Serial0/0/1, directly connected
L   2001:DB8:CAFE:A002::1/128 [0/0]
     via Serial0/0/1, receive
O   2001:DB8:CAFE:A003::/64 [110/128]
     via FE80::1, Serial0/0/0
     via FE80::3, Serial0/0/1
L   FF00::/8 [0/0]
     via Null0, receive
R2#
```

## R3
```
R3#show ipv6 ospf neighbor

Neighbor ID     Pri   State           Dead Time   Interface ID    Interface
1.1.1.1           0   FULL/  -        00:00:31    5               Serial0/0/0
2.2.2.2           0   FULL/  -        00:00:37    5               Serial0/0/1

R3#show ipv6 route
IPv6 Routing Table - 10 entries
Codes: C - Connected, L - Local, S - Static, R - RIP, B - BGP
       U - Per-user Static route, M - MIPv6
       I1 - ISIS L1, I2 - ISIS L2, IA - ISIS interarea, IS - ISIS summary
       ND - ND Default, NDp - ND Prefix, DCE - Destination, NDr - Redirect
       O - OSPF intra, OI - OSPF inter, OE1 - OSPF ext 1, OE2 - OSPF ext 2
       ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       D - EIGRP, EX - EIGRP external
O   2001:DB8:CAFE:1::/64 [110/65]
     via FE80::1, Serial0/0/0
O   2001:DB8:CAFE:2::/64 [110/65]
     via FE80::2, Serial0/0/1
C   2001:DB8:CAFE:3::/64 [0/0]
     via GigabitEthernet0/0, directly connected
L   2001:DB8:CAFE:3::1/128 [0/0]
     via GigabitEthernet0/0, receive
O   2001:DB8:CAFE:A001::/64 [110/128]
     via FE80::1, Serial0/0/0
     via FE80::2, Serial0/0/1
C   2001:DB8:CAFE:A002::/64 [0/0]
     via Serial0/0/1, directly connected
L   2001:DB8:CAFE:A002::2/128 [0/0]
     via Serial0/0/1, receive
C   2001:DB8:CAFE:A003::/64 [0/0]
     via Serial0/0/0, directly connected
L   2001:DB8:CAFE:A003::2/128 [0/0]
     via Serial0/0/0, receive
L   FF00::/8 [0/0]
     via Null0, receive
R3#
```
